In [26]:
import pandas as pd
import numpy as np

In [27]:
df = pd.read_csv("train_titanic.csv")

In [28]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [29]:
df.drop(["PassengerId",'Name',"Ticket","Cabin"],axis='columns',inplace=True)

In [30]:
df.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

In [38]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 889 entries, 0 to 890
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  889 non-null    int64
 1   Pclass    889 non-null    int64
 2   Sex       889 non-null    object
 3   Age       889 non-null    float64
 4   SibSp     889 non-null    int64
 5   Parch     889 non-null    int64
 6   Fare      889 non-null    float64
 7   Embarked  889 non-null    object
dtypes: float64(2), int64(4), object(2)
memory usage: 62.5+ KB

In [33]:
df.dropna(subset=['Embarked'],inplace=True)

In [36]:
df.Age.median()

28.0

In [37]:
df['Age']=df['Age'].fillna(df.Age.median())

In [39]:
df.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

In [40]:
sex_dummies=pd.get_dummies(df.Sex)

In [41]:
embark=pd.get_dummies(df.Embarked)

In [43]:
dummy = pd.concat([sex_dummies,embark],axis='columns')

In [46]:
dummy.head()

   male  C  Q
0     1  0  0
1     0  1  0
2     0  0  0
3     0  0  0
4     1  0  0

In [45]:
dummy.drop(['female','S'],axis='columns',inplace=True)

In [47]:
df = pd.concat([df,dummy],axis='columns')

In [51]:
df.head()

   Survived  Pclass   Age  SibSp  Parch     Fare  male  C  Q
0         0       3  22.0      1      0   7.2500     1  0  0
1         1       1  38.0      1      0  71.2833     0  1  0
2         1       3  26.0      0      0   7.9250     0  0  0
3         1       1  35.0      1      0  53.1000     0  0  0
4         0       3  35.0      0      0   8.0500     1  0  0

In [50]:
df.drop(['Sex','Embarked'],axis='columns',inplace=True)

In [52]:
X = df.drop("Survived",axis="columns")

In [53]:
X.head()

   Pclass   Age  SibSp  Parch     Fare  male  C  Q
0       3  22.0      1      0   7.2500     1  0  0
1       1  38.0      1      0  71.2833     0  1  0
2       3  26.0      0      0   7.9250     0  0  0
3       1  35.0      1      0  53.1000     0  0  0
4       3  35.0      0      0   8.0500     1  0  0

In [54]:
y=df.Survived

In [55]:
y.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [56]:
from sklearn.linear_model import LogisticRegression

In [57]:
model = LogisticRegression()

In [58]:
model.fit(X,y)

C:\ProgramData\anaconda3\lib\site-packages\sklearn\linear_model\_logistic.py:458: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  n_iter_i = _check_optimize_result(

LogisticRegression()

In [59]:
model.score(X,y)

0.7997750281214848

In [60]:
import joblib

In [61]:
joblib.dump(model,"Zeeshan_titanic.pkl")

['Zeeshan_titanic.pkl']